; -----------------------------------------
; расчёт позиции имени в сетке из трёх столбцов и восьми строк
; исходный диапазон #CBDB..#CBF0
; In:
;   AF, A содержит позицию 0..23
; Out:
;   HL и DE сохранены
;   BC, B=5+(позиция&7), C=2/12/22
; Corrupt:
;   BC, AF
; Note:
;   Младшие три бита выбирают строку, биты старшей части выбирают столбец.
;   Значения вне 0..23 не проверяются, все от 16 попадают в третий столбец.
; -----------------------------------------
SavePosition:   LD C, A
                AND #07
                ADD A, #05
                LD B, A
                LD A, C
                AND #F8
                LD C, #02
                CP #08
                RET C                                                           ; выход, если номер позиции меньше 8 и выбран первый столбец

                LD C, #0C
                CP #10
                RET C                                                           ; выход, если номер позиции меньше 16 и выбран второй столбец

                LD C, #16
                RET
