                module Flight
                module DispatchDangerIndicator
; -----------------------------------------
; Вектор обновления индикатора опасности
; исходный диапазон #7121..#7124
; In:
;   состояние полёта
; Out:
;   передача управления 99A4
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   7124 после JP является блокировкой ручного обновления скорости и вращения
; -----------------------------------------
                ASSERT $ == #7121
                ; передача управления общему индикатору опасности
Entry:          JP Game.Scanner.DrawDangerAndMissileIndicators.Entry
                ; блокировка ручного обновления углов и скорости
ControlsLocked  DB #00                                                          ; флаг, главный цикл пропускает ручное обновление крена, тангажа и скорости
                ASSERT $ == #7125
                endmodule
                endmodule
