                module Flight
                module InitializeViewAttributes
; -----------------------------------------
; Инициализация 480 атрибутов верхней области
; исходный диапазон #7461..#7466
; In:
;   без параметров
; Out:
;   5820..59FF заполнены 07, HL=5A00,B=0
; Corrupt:
;   HL, BC, AF
; Note:
;   CALL7467 заполняет 240 байтов, затем проваливание 7467 выполняет второй такой же проход
; -----------------------------------------
                ASSERT $ == #7461
                ; два прохода 7467 заполняют 480 атрибутов от 5820
Entry:          LD HL, Memory.Attributes + #0020                                ; атрибуты со второй символьной строки
                CALL Game.Flight.Fill240Attributes.Entry
                ASSERT $ == #7467
                endmodule
                endmodule
