                module Disk
                module ConvertTrackForDrive
; -----------------------------------------
; Преобразование номера дорожки при выбранном типе устройства
; исходный диапазон #DA14..#DA16
; In:
;   BC, C = дорожка, IX = внутренняя процедура TR-DOS
; Out:
;   C сдвинут вправо, при исходном младшем бите 0 немедленный возврат
; Corrupt:
;   BC, AF, IX
; Note:
;   При исходном младшем бите 1 продолжается в Game.Disk.CallDosWithDriveParameter.Entry и вызывает прошивку, формат устройства
;   выбирает вызывающий тестом DriveFlags AND2
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #DA14
                ; сведение логического номера дорожки к физической дорожке и стороне диска
Entry:          SRL C
                RET NC                                                          ; выход, если исходный номер дорожки чётный, дополнительная сторона не требуется, иначе далее Game.Disk.CallDosWithDriveParameter.Entry без команды перехода

                ; проверка исходного конца фрагмента
                ASSERT $ == #DA17
                endmodule
                endmodule
