                module Wireframe
                module UnscaleClippingRatio
; -----------------------------------------
; восстановление старших разрядов разностей перед делением
; исходный диапазон #B29F..#B2A9
; In:
;   HL, H и L содержат частично уменьшенные разности
;   BC, биты 7/6 C содержат их старшие разряды
; Out:
;   HL, отношение разностей в формате 8.8 через общий хвост Game.Wireframe.DivideSlopeAndDrawScanner.Entry
;   DE, исходное значение
; Corrupt:
;   BC, AF
; Note:
; Если старших разрядов нет, немедленно переходит в деление.
; Иначе оба модуля делятся пополам с возвратом соответствующих старших битов.
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #B29F
                ; проверка необходимости общего уменьшения разностей перед делением
Entry:          LD A, C
                AND #C0
                JR Z, Game.Wireframe.DivideSlopeAndDrawScanner.Entry            ; переход, если оба восстановляемых старших разряда равны нулю

                RLCA
                RR H
                RLCA
                RR L                                                            ; далее Game.Wireframe.DivideSlopeAndDrawScanner.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #B2AA
                endmodule
                endmodule
