; -----------------------------------------
; Битовая сетка графического знака
; исходный диапазон #ED2F..#ED5B
; In:
;   чтение XorDemoMark слева направо по старшему биту
; Out:
;   44 байта клеток и завершающий FF
; Corrupt:
;   нет,45 байтов данных
; Note:
;   352 позиции клеток, только единичные биты расходуют индекс MarkShapes
; -----------------------------------------
MarkCellMap     DB #07, #47, #77, #70, #04, #42, #74, #70                       ; данные #ED2F..#ED36
                DB #07, #42, #27, #30                                           ; данные #ED37..#ED3A
                DB #05, #52, #25, #50, #07, #77, #27, #70                       ; данные #ED3B..#ED42
                DB #00, #00, #00, #00                                           ; данные #ED43..#ED46
                DB #00, #F7, #4B, #80, #00, #54, #7A, #80                       ; данные #ED47..#ED4E
                DB #00, #57, #7A, #80                                           ; данные #ED4F..#ED52
                DB #00, #55, #4A, #80, #00, #F7, #4B, #80                       ; данные #ED53..#ED5A
                DB #FF                                                          ; данные #ED5B..#ED5B
