; -----------------------------------------
; Чтение восьми физических строк клавиатуры
; исходный диапазон #EA1D..#EA33
; In:
;   аппаратный порт FE
; Out:
;   Keyboard содержит восемь инвертированных строк, Keyboard.ScannedMarker=1
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   B вращается 7F→FE→FD→FB→F7→EF→DF→BF→7F, младшие 5 бит единицей обозначают нажатие
;   После AND1F/CPL верхние 3 бита равны 1, изменённый Game.Input.ScanKeyboardMatrix.Entry учитывает только младшие 5
; -----------------------------------------
                ; начальные порт и указатель для восьми физических строк клавиатуры
ReadKeyboard:   LD HL, Keyboard
                LD BC, #7FFE
                LD D, #08
                ; опрос строки с инверсией активного уровня клавиш и переход к следующему порту
ReadKeyRow:     RLC B
                IN A, (C)
                AND #1F
                CPL
                LD (HL), A
                INC HL
                DEC D
                JR NZ, ReadKeyRow                                               ; переход, если не все восемь строк клавиатуры прочитаны, продолжить опрос

                LD (HL), #01                                                    ; HL, Keyboard.ScannedMarker, отметка завершённого опроса
                RET
