                module Circles
                module SetBothContourBoundaries
; -----------------------------------------
; две фиксированные границы контура
; исходный диапазон #8FF9..#9003
; смысловое имя SetBothContourBoundaries
; In: HL — правый адрес строки
; Out: E=(L&#E0)
; 1, B=#80, C=1
; Corrupt: DE — E, BC, AF
; Первый столбец патчится с 1 на 0 для полного экрана карты
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #8FF9
                ; расчёт адреса фиксированного левого края и двух крайних пикселей
Entry:          LD A, L
                AND #E0
                OR #01
                LD E, A
                LD C, #01
                LD B, #80
                RET
                ; проверка исходного конца фрагмента
                ASSERT $ == #9004
                endmodule
                endmodule
