                module Universe
                module SetStationEnergy
; -----------------------------------------
; установка исходной энергии станционного объекта
; исходный диапазон #7892..#7897
; In:
;   IX, станционный слот
; Out:
;   FSpaceObject.Energy станционного слота равен #F0
; Corrupt:
;   AF
; Note:
; Общий хвост обновления станции и создания её расширенного варианта.
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #7892
                ; обновление энергии станционного слота
Entry:          LD A, #F0
                LD (IX+FSpaceObject.Energy), A
                RET

                ; проверка исходного конца фрагмента
                ASSERT $ == #7898
                endmodule
                endmodule
