                module Motion
                module NegatedQuarterCoordinate
; -----------------------------------------
; получение координаты с обратным знаком в масштабе четверти
; исходный диапазон #A568..#A56E
; In:
;   IX, адрес трёхбайтовой координаты
; Out:
;   HL, знако-модульная четверть обратной координаты
;   DE, число 3
;   IX, адрес следующей координаты
; Corrupt:
;   AF
; Note:
; Знак инвертируется перед общим хвостом Game.Motion.QuarterCoordinate.QuarterModule.
; Используется для направления от объекта к игроку в начале координат.
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #A568
                ; подготовка обратного знака перед преобразованием координаты
Entry:          LD A, (IX + FCoordinate.SignHigh)
                XOR #80
                JR Game.Motion.QuarterCoordinate.QuarterModule

                ; проверка исходного конца фрагмента
                ASSERT $ == #A56F
                endmodule
                endmodule
