                module Motion
                module QuarterCoordinate
; -----------------------------------------
; получение координаты в масштабе четверти
; исходный диапазон #A56F..#A586
; In:
;   IX, адрес трёхбайтовой координаты
; Out:
;   HL, знако-модульная четверть координаты
;   DE, число 3
;   IX, адрес следующей координаты
; Corrupt:
;   AF
; Note:
; Сохраняются младшие 16 бит модуля и знак третьего байта.
; Вход #A572 принимает уже прочитанный или инвертированный байт знака в A.
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #A56F
                ; чтение знака координаты
Entry:          LD A, (IX + FCoordinate.SignHigh)
                ; расчёт четверти модуля и перенос знака в бит 15
QuarterModule:  LD L, (IX + FCoordinate.Fraction)
                LD H, (IX + FCoordinate.Low)
                SRL H
                RR L
                RLA
                RR H
                RR L
                LD DE, #0003
                ADD IX, DE
                RET
                ; проверка исходного конца фрагмента
                ASSERT $ == #A587
                endmodule
                endmodule
