                module Motion
                module XorFarObjectPixel
; -----------------------------------------
; вывод пикселя далёкого объекта в теневой буфер
; исходный диапазон #A83C..#A84C
; In:
;   BC, B содержит экранную строку, C столбец
; Out:
;   HL, адрес изменённого байта буфера
; Corrupt:
;   DE, AF
; Note:
; ROM #22B1 вычисляет адрес байта и позицию бита.
; SET 7,H переносит адрес #4000 в буфер #C000. XOR используется для рисования и стирания.
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #A83C
                ; расчёт адреса и маски пикселя
Entry:          LD A, B
                CALL Rom.PixelAddress
                LD D, A
                INC D
                LD A, #01
RotatePixel:    RRCA
                DEC D
                JR NZ, RotatePixel                                              ; переход, если маска ещё не дошла до требуемого бита пикселя
PixelMode       EQU $ + 1                                                       ; два байта конца SET 7,H и XOR (HL), патч прямого экрана
                SET 7, H
                XOR (HL)
                LD (HL), A
                RET
                ; проверка исходного конца фрагмента
                ASSERT $ == #A84D
                endmodule
                endmodule
