
; -----------------------------------------------------------------------------
; запись одной растровой строки одного символа
; In:
;   DE - адрес выходного байта экрана
;   AF - A содержит код символа
; Out:
;   DE - следующий выходной байт
;   AF - A содержит растровый байт глифа
; Corrupt:
;   AF, HL', BC'
; Note:
;   основные HL и BC сохранены посредством EXX
;   адрес шрифта - CHARS + код * 8 + номер растровой строки
;   обратный просмотр использует номер 7 - GlyphRow
; -----------------------------------------------------------------------------
RenderGlyph:    ; запись одной растровой строки одного символа
                ; расчёт адреса глифа в альтернативных регистрах, CHARS + код * 8
                EXX
                LD L, A
                LD H, #00
                ADD HL, HL
                ADD HL, HL
                ADD HL, HL
                LD BC, (CHARS)
                ADD HL, BC
                ; выбор строки глифа согласно направлению прокрутки
                LD B, #00
                LD A, (GlyphRow)
                LD C, A
                LD A, (Reverse)
                AND A
                JR Z, FetchGlyphRow                                             ; переход, если выбрано прямое направление строк шрифта

                ; расчёт обратного номера строки глифа, 7 - GlyphRow
                LD A, #07
                SUB C
                LD C, A
FetchGlyphRow:  ; расчёт адреса строки глифа и запись байта в экран
                ; расчёт адреса строки глифа и запись байта в экран
                ADD HL, BC
                LD A, (HL)
                EXX
                LD (DE), A
                INC DE
                RET

                ; проверка исходной границы блока
                assert $ = #99D9
