; исходные строки интерфейса, BASIC-команда и состояние просмотрщика
Selection       DB #00                                                          ; ASCII-код выбранного раздела
ViewState       DB #FF                                                          ; состояние просмотра, 255 продолжение
TextPointer     DW #0000                                                        ; адрес текущей строки распакованного текста

                ; проверка исходной границы блока
                assert $ = #976C
