
; -----------------------------------------------------------------------------
; переключение направления обратно после недопустимого изменения
; In:
;   Reverse - направление после опроса
; Out:
;   Reverse - противоположное направление
; Corrupt:
;   HL, AF
; Note:
;   операция XOR 1 рассчитана на значения 0 и 1
; -----------------------------------------------------------------------------
UndoDirection:  ; переключение направления обратно после недопустимого изменения
                ; отмена изменения направления при недопустимой границе
                LD HL, Reverse
                LD A, (HL)
                XOR MAN_REV_MASK
                LD (HL), A
                RET

                ; проверка исходной границы блока
                assert $ = #9A28
