                module Galaxy
                module MultiplyBytes
; -----------------------------------------
; Беззнаковое умножение двух байтов
; исходный диапазон #E009..#E01B
; In:
;   DE, D = первый множитель, AF, A = второй множитель
; Out:
;   HL=D вход*A вход, B=0
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   Восемь шагов сдвига DE вправо и A влево накапливают выбранные частичные произведения, E
;   предварительно обнуляется
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #E009
                ; восемь битов A выбирают слагаемые D*128, D*64 и далее до D
Entry:          LD E, #00
                LD B, #08
                LD HL, #0000
MultiplyBit:    SRL D
                RR E
                RL A
                JR NC, NextBit                                                  ; переход, если очередной бит множителя нулевой, прибавление частичного произведения не нужно

                ADD HL, DE
NextBit:        DJNZ MultiplyBit

                RET
                ; проверка исходного конца фрагмента
                ASSERT $ == #E01C
                endmodule
                endmodule
