                module Menus
                module PrintInlineTokenIfNonzero
; -----------------------------------------
; Условная печать токена из потока команд
; исходный диапазон #F068..#F06E
; In:
;   AF, A = условие, байт после CALL = токен
; Out:
;   Адрес возврата+1 всегда, при A!=0 токен напечатан с переводом строки
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   Даже при нулевом условии встроенный байт поглощается, номер временно хранится в B
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #F068
                ; встроенный токен считывается и пропускается даже при нулевом A
Entry:          POP HL
                LD B, (HL)
                INC HL
                PUSH HL
                AND A
                RET Z                                                           ; выход, если исходный A нулевой, пропустить уже прочитанный встроенный токен

                LD A, B                                                         ; далее Game.Menus.PrintEquipmentLine.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #F06F
                endmodule
                endmodule
