                module Menus
                module ReturnZero
; -----------------------------------------
; Нулевое значение для насыщения координаты
; исходный диапазон #EC3B..#EC3C
; In:
;   Нет параметров
; Out:
;   A=0, Z=1, CY=0
; Corrupt:
;   AF
; Note:
;   Используется условным CALL при выходе нижней границы карты за 0
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #EC3B
                ; насыщение отрицательной координаты до нуля для вычисления границы карты
Entry:          XOR A
                RET
                ; проверка исходного конца фрагмента
                ASSERT $ == #EC3D
                endmodule
                endmodule
