                module Trade
                module GetEquipmentStateAddress
; -----------------------------------------
; Адрес состояния оборудования
; исходный диапазон #EB38..#EB3D
; In:
;   E8AB = номер пункта
; Out:
;   HL=D081+номер, DE=номер
; Corrupt:
;   HL, DE, AF
; Note:
;   Используется линейными диапазонами оборудования, лазеры обрабатываются отдельно
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #EB38
                ; индекс оборудования переводится в поле сериализуемого командира
Entry:          LD HL, State.Mission1
                LD A, (TradeSnapshot.Selection)
                ; проверка исходного конца фрагмента
                ASSERT $ == #EB3E
                endmodule
                endmodule
