                module Trade
                module SetInlineTextColumn
; -----------------------------------------
; Установка X из байта после CALL
; исходный диапазон #E2BC..#E2BF
; In:
;   Стек содержит адрес встроенного байта
; Out:
;   Адрес возврата увеличен на 1, X установлен либо выполнен перенос
; Corrupt:
;   HL, AF
; Note:
;   Поглощает один байт и продолжает Game.Trade.SetTextColumn.Entry, требуется корректный адрес возврата на стеке
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #E2BC
                ; извлечение X из адреса возврата с пропуском одного байта потока команд
Entry:          POP HL
                LD A, (HL)
                INC HL
                PUSH HL                                                         ; далее Game.Trade.SetTextColumn.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #E2C0
                endmodule
                endmodule
