                module Trade
                module SetTextColumn
; -----------------------------------------
; Установка колонки с контролем ширины
; исходный диапазон #E2C0..#E2C7
; In:
;   AF, A = новая X
; Out:
;   D045=A при A<32, иначе перевод строки
; Corrupt:
;   AF
; Note:
;   При A>=32 переходит в E2A9, который обнуляет X и увеличивает Y
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #E2C0
                ; колонка записывается до проверки, выход за 31 вызывает переход строки
Entry:          LD (TextColumn), A
                CP #20
                RET C                                                           ; выход, если колонка меньше 32, она находится в пределах строки

                JR Game.Trade.Newline.Entry
                ; проверка исходного конца фрагмента
                ASSERT $ == #E2C8
                endmodule
                endmodule
