                module Screen
                module NextScanline
; -----------------------------------------
; переход HL на следующую пиксельную строку Spectrum
; In:
;   HL, адрес пиксельного байта
; Out:
;   HL, тот же столбец следующей строки
; Corrupt:
;   HL, AF
; Note:
;   внутри знакоместа увеличивается H
;   при пересечении восьмой строки #8445 переносит адрес в следующую строку знакомест
;   байт RET по #7FEF является отдельным сохранённым пустым входом
; -----------------------------------------
                ; проверка исходного размещения
                ASSERT $ == #7FE7
                ; расчёт следующей строки с проверкой границы знакоместа
Entry:          INC H
                LD A, H
                AND #07
                CALL Z, Game.Screen.NextCharacterRow.Entry                      ; вызов, если младшие три бита H обнулились, нужна коррекция адреса
                RET
                DB #C9                                                          ; исходные байты #7FEF..#7FEF
                ASSERT $ == #7FF0
                endmodule
                endmodule
