                module Screen
                module NextCharacterRow
; -----------------------------------------
; коррекция адреса после перехода вниз через восемь пиксельных строк
; In:
;   HL, адрес после INC H на границе знакоместа
; Out:
;   HL, адрес той же колонки следующего знакоместа
; Corrupt:
;   HL, AF
; Note:
;   к L прибавляется #20, при отсутствии переноса из H вычитается 8
;   если L переполнился, переход между третями экрана уже выполнен
; -----------------------------------------
                ; проверка исходного размещения
                ASSERT $ == #8445
                ; расчёт переноса в следующую строку знакомест
Entry:          LD A, L
                ADD A, #20
                LD L, A
                RET C                                                           ; выход, если переполнение L уже перевело адрес в следующую треть

                LD A, H
                SUB #08
                LD H, A
                RET

                ASSERT $ == #844F
                endmodule
                endmodule
