                module Screen
                module RestoreCockpitIfNeeded
; -----------------------------------------
; восстановление кабины при уходе с текстового экрана
; In:
;   байт #4020, маркер текстового экрана #FF
; Out:
;   кабина восстановлена при установленном маркере
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   если #4020 не равен #FF, процедура сразу возвращается
;   иначе очищаются события клавиатуры, затем выполняется #804B через проваливание
; -----------------------------------------
                ; проверка исходного размещения
                ASSERT $ == #8042
                ; проверка маркера текстового экрана
Entry:          LD DE, Memory.Screen + #0020                                    ; первый байт строки 8, маркер текстового экрана
                LD A, (DE)
                INC A
                RET NZ                                                          ; выход, если по #4020 нет маркера #FF

                CALL Game.Flight.ClearFlightKeyEvents.Entry
                ASSERT $ == #804B
                endmodule
                endmodule
