                module Economy
                module PrintByteInteger
; -----------------------------------------
; Печать беззнакового байта без дробной части
; исходный диапазон #D2E1..#D2E4
; In:
;   AF, A = число
; Out:
;   Число выведено
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   AND A снимает перенос, затем H=0, L=A и исполнение продолжается в D2E5
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #D2E1
                ; целый формат, A расширяется до слова без знака
Entry:          AND A
ExtendByte:     LD H, #00
                LD L, A
                ; проверка исходного конца фрагмента
                ASSERT $ == #D2E5
                endmodule
                endmodule
