                module Sound
                module DivideBC16
; -----------------------------------------
; логическое деление беззнакового BC на 16
; исходный диапазон #96C5..#96C8
; In:
;   BC - делимое
; Out:
;   BC - исходное значение >> 4
;   AF - C содержит исходный бит 3
; Corrupt:
;   BC, AF
; Note:
;   четыре последовательных SRL B / RR C, входы /8, /4 и /2 находятся внутри общего хвоста
;   HL и DE не изменяются, возврат выполняет общий хвост Game.Sound.DivideBC2.Entry
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #96C5
Entry:          SRL B
                RR C                                                            ; далее Game.Sound.DivideBC8.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #96C9
                endmodule
                endmodule
