                module Sound
                module DivideBC2
; -----------------------------------------
; логическое деление беззнакового BC на 2
; исходный диапазон #96D1..#96D5
; In:
;   BC - делимое
; Out:
;   BC - исходное значение >> 1
;   AF - C содержит исходный бит 0
; Corrupt:
;   BC, AF
; Note:
;   общий выход для четырёх входов деления, HL и DE сохраняются
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #96D1
Entry:          SRL B
                RR C
                RET

                ; проверка исходного конца фрагмента
                ASSERT $ == #96D6
                endmodule
                endmodule
