                module Sound
                module DivideBC4
; -----------------------------------------
; логическое деление беззнакового BC на 4
; исходный диапазон #96CD..#96D0
; In:
;   BC - делимое
; Out:
;   BC - исходное значение >> 2
;   AF - C содержит исходный бит 1
; Corrupt:
;   BC, AF
; Note:
;   после первой пары сдвигов выполнение продолжается в DivBC_2
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #96CD
Entry:          SRL B
                RR C                                                            ; далее Game.Sound.DivideBC2.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #96D1
                endmodule
                endmodule
