                module Sound
                module DivideBC8
; -----------------------------------------
; логическое деление беззнакового BC на 8
; исходный диапазон #96C9..#96CC
; In:
;   BC - делимое
; Out:
;   BC - исходное значение >> 3
;   AF - C содержит исходный бит 2
; Corrupt:
;   BC, AF
; Note:
;   после первой пары сдвигов выполнение продолжается в DivBC_4 и DivBC_2
; -----------------------------------------
                ; проверка исходного начала фрагмента
                ASSERT $ == #96C9
Entry:          SRL B
                RR C                                                            ; далее Game.Sound.DivideBC4.Entry без команды перехода
                ; проверка исходного конца фрагмента
                ASSERT $ == #96CD
                endmodule
                endmodule
